# parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0
   [-1, 1, Conv, [128, 3, 2]],  # 1
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3
   [-1, 6, C3, [256]],
   [-4, 1, Conv, [64, 6, 2, 2]],  # 5
   [-1, 1, Conv, [128, 3, 2]],  # 6
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 8
   [-1, 6, C3, [256]],        

   [[4,9], 1, DMAF, [256]],    # 10     0: Frd; 1: Ftd
   [[4,10], 1, Add2, [256,0]],    # 11-P3/8 stream one x+DMAF[0]
   [[9,10], 1, Add2, [256,1]],    # 12-P3/8 stream two x+DMAF[1]

   [11, 1, Conv, [512, 3, 2]],  # 13
   [-1, 9, C3, [512]],
   [12, 1, Conv, [512, 3, 2]],  # 15
   [-1, 9, C3, [512]],

   [[14,16], 1, DMAF, [512]],    # 17   0: Frd; 1: Ftd
   [[14,17], 1, Add2, [512,0]],    # 18-P3/8 stream one x+DMAF[0]
   [[16,17], 1, Add2, [512,1]],    # 19-P3/8 stream two x+DMAF[1]

   [18, 1, Conv, [1024, 3, 2]],  # 20
   [-1, 3, C3, [1024, False]],  
   [-1, 1, SPPF, [1024, 5]],
   [19, 1, Conv, [1024, 3, 2]],  # 23
   [-1, 3, C3, [1024, False]],  
   [-1, 1, SPPF, [1024, 5]],

   [[22,25], 1, DMAF, [1024]],    # 26  0: Frd; 1: Ftd
   [[22,26], 1, Add2, [1024,0]],    # 27-P5/32 stream one x+DMAF[0]
   [[25,26], 1, Add2, [1024,1]],    # 28-P5/32 stream two x+DMAF[1]

       ######### Add Block #############
   [[11,12], 1, Add, [1]],   # 29-P3/8 fusion backbone P3
   [[18,19], 1, Add, [1]],   # 30-P4/16 fusion backbone P4
   [[27,28], 1, Add, [1]],   # 31-P5/32 fusion backbone P5
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          # 32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,30], 1, Concat, [1]],           # 34 cat backbone P4
   [-1, 3, C3, [512, False]],           

   [-1, 1, Conv, [256, 1, 1]],          # 36
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,29], 1, Concat, [1]],           # 38 cat backbone P3
   [-1, 3, C3, [256, False]],           # 39 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 40
   [[-1,36], 1, Concat, [1]],           # 41 cat head P4
   [-1, 3, C3, [512, False]],           # 42 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 43
   [[-1,32], 1, Concat, [1]],           # 44 cat head P5
   [-1, 3, C3, [1024, False]],          # 45 (P5/32-large)

   [[39, 42, 45], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]

layer_list:
  [0,1,2,3,4,0,1,2,3,4, -1,-1,-1, 5,6,5,6, -1,-1,-1, 7,8,9,7,8,9, -1,-1,-1,-1,-1,-1, 10,-1,-1,13,14,-1,-1,17,18,-1,20,21,-1,23, -1] # all