# parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024, False]],  

   [-4, 1, Conv, [64, 6, 2, 2]],  # 9-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 10-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 12-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 14-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 16-P5/32
   [-1, 3, C3, [1024, False]],  
   

   ############ illumination #############
   [[0,9], 1, Illumination_v6, []], 
   [[4,13,18], 1, Illumination_weight, [256]],    # 19 two stream fuse     ### layer20 is Illumination value
   [[6,15,18], 1, Illumination_weight, [512]],    # 20 two stream fuse
   [[8,17,18], 1, Illumination_weight, [1024]],    # 21 two stream fuse

   ######### Add Block #############
   [[4,19], 1, Add2, [256,0]],    # 22-P3/8 stream one x+trans[0]
   [[13,19], 1, Add2, [256,1]],    # 23-P3/8 stream two x+trans[1]

   [[6,20], 1, Add2, [512,0]],    # 24-P3/8 stream one x+trans[0]
   [[15,20], 1, Add2, [512,1]],    # 25-P3/8 stream two x+trans[1]

   [[8,21], 1, Add2, [1024,0]],    # 26-P5/32 stream one x+trans[0]
   [[17,21], 1, Add2, [1024,1]],    # 27-P5/32 stream two x+trans[1]

   [[22,23], 1, Add, [1]],   # 28-P3/8 fusion backbone P3
   [[24,25], 1, Add, [1]],   # 29-P4/16 fusion backbone P4
   [[26,27], 1, Add, [1]],   # 30-P5/32 fusion backbone P5

   [-1, 1, SPPF, [1024, 5]],  # 31
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,29], 1, Concat, [1]],           # 34 cat backbone P4
   [-1, 3, C3, [512, False]],           

   [-1, 1, Conv, [256, 1, 1]],          
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,28], 1, Concat, [1]],           # 38 cat backbone P3
   [-1, 3, C3, [256, False]],           # 39 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          
   [[-1,36], 1, Concat, [1]],           # 41 cat head P4
   [-1, 3, C3, [512, False]],           # 42 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          
   [[-1,32], 1, Concat, [1]],           # 44 cat head P5
   [-1, 3, C3, [1024, False]],          # 45 (P5/32-large)

   [[39, 42, 45], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]

layer_list:
  [0,1,2,3,4,5,6,7,8, 0,1,2,3,4,5,6,7,8, -1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1, 9,10,-1,-1,13,14,-1,-1,17,18,-1,20,21,-1,23, -1] # all