# parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0
   [-1, 1, Conv, [128, 3, 2]],  # 1
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3
   [-1, 6, C3, [256]],
   [-4, 1, Conv, [64, 6, 2, 2]],  # 5
   [-1, 1, Conv, [128, 3, 2]],  # 6
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 8
   [-1, 6, C3, [256]],        

   [[0,5], 1, Illumination_v6, []], 
   [[4,9,10], 1, Illumination_weight, [256]],    # 11
   [[4,11], 1, Add2, [256,0]],   
   [[9,11], 1, Add2, [256,1]],   

   [12, 1, Conv, [512, 3, 2]],  # 14
   [-1, 9, C3, [512]],
   [13, 1, Conv, [512, 3, 2]],  # 16
   [-1, 9, C3, [512]],

   [[15,17,10], 1, Illumination_weight, [512]],    # 18
   [[15,18], 1, Add2, [512,0]],             
   [[17,18], 1, Add2, [512,1]],    

   [19, 1, Conv, [1024, 3, 2]],  # 21
   [-1, 3, C3, [1024, False]],  
   [-1, 1, SPPF, [1024, 5]],
   [20, 1, Conv, [1024, 3, 2]],  # 24
   [-1, 3, C3, [1024, False]],  
   [-1, 1, SPPF, [1024, 5]],

   [[23,26,10], 1, Illumination_weight, [1024]],    # 27
   [[23,27], 1, Add2, [1024,0]],    
   [[26,27], 1, Add2, [1024,1]],    

       ######### Add Block #############
   [[12,13], 1, Add, [1]],   # 30-P3/8 fusion backbone P3
   [[19,20], 1, Add, [1]],   # 31-P4/16 fusion backbone P4
   [[28,29], 1, Add, [1]],   # 32-P5/32 fusion backbone P5
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          # 33
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,31], 1, Concat, [1]],           # 35 cat backbone P4
   [-1, 3, C3, [512, False]],           

   [-1, 1, Conv, [256, 1, 1]],          # 37
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,30], 1, Concat, [1]],           # 39 cat backbone P3
   [-1, 3, C3, [256, False]],           # 40 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 41
   [[-1,37], 1, Concat, [1]],           # 42 cat head P4
   [-1, 3, C3, [512, False]],           # 43 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 44
   [[-1,33], 1, Concat, [1]],           # 45 cat head P5
   [-1, 3, C3, [1024, False]],          # 46 (P5/32-large)

   [[40, 43, 46], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]

layer_list:
  # [0,1,2,3,4,0,1,2,3,4, -1,-1,-1,-1, 5,6,5,6, -1,-1,-1, 7,8,9,7,8,9, -1,-1,-1,-1,-1,-1, 10,-1,-1,13,14,-1,-1,17,18,-1,20,21,-1,23, -1] # all
  [0,1,2,3,4,0,1,2,3,4, -1,-1,-1,-1, 5,6,5,6, -1,-1,-1, 7,8,9,-1,-1,-1, -1,-1,-1,-1,-1,-1, 10,-1,-1,13,14,-1,-1,17,18,-1,20,21,-1,23, -1] # 7 8 9 random
