# parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-4, 1, Conv, [64, 6, 2, 2]],  # 4-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 5-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 7-P3/8
   [[0,4], 1, Illumination_v6, []],   
   [[3,7,8], 1, Illumination_weight, [256]],    # 9 two stream fuse 
   [[3,9], 1, Add2, [256,0]],    # 10-P3/8 stream one x+trans[0]
   [[7,9], 1, Add2, [256,1]],    # 11-P3/8 stream two x+trans[1]
   [[10,11], 1, Add, [1]],   # 12-P3/8 fusion backbone P3
   [-1, 6, C3, [256]],       # 13


   [13, 1, Conv, [512, 3, 2]],  # 14-P4/16
   [13, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [[14,15,8], 1, Illumination_weight, [512]],    # 16 two stream fuse
   [[14,16], 1, Add2, [512,0]],    # 17-P3/8 stream one x+trans[0]
   [[15,16], 1, Add2, [512,1]],    # 18-P3/8 stream two x+trans[1]
   [[17,18], 1, Add, [1]],   # 19-P4/16 fusion backbone P4
   [-1, 9, C3, [512]],      # 20


   [20, 1, Conv, [1024, 3, 2]],  # 21-P5/32
   [20, 1, Conv, [1024, 3, 2]],  # 22-P5/32
   [[21,22,8], 1, Illumination_weight, [1024]],    # 23 two stream fuse
   [[21,23], 1, Add2, [1024,0]],    # 24-P5/32 stream one x+trans[0]
   [[22,23], 1, Add2, [1024,1]],    # 25-P5/32 stream two x+trans[1]
   [[24,25], 1, Add, [1]],   # 26-P5/32 fusion backbone P5
   [-1, 3, C3, [1024, False]],  # 27
   [-1, 1, SPPF, [1024, 5]],  # 28
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          # 29
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,19], 1, Concat, [1]],           # 31 cat backbone P4
   [-1, 3, C3, [512, False]],           

   [-1, 1, Conv, [256, 1, 1]],          
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,12], 1, Concat, [1]],           # 35 cat backbone P3
   [-1, 3, C3, [256, False]],           # 36 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          
   [[-1,33], 1, Concat, [1]],           # 38 cat head P4
   [-1, 3, C3, [512, False]],           # 39 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          
   [[-1,29], 1, Concat, [1]],           # 41 cat head P5
   [-1, 3, C3, [1024, False]],          # 42 (P5/32-large)

   [[36, 39, 42], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]

layer_list:
  [0,1,2,3,0,1,2,3,-1,-1,-1,-1,-1,4, 5,5,-1,-1,-1,-1,6, 7,7,-1,-1,-1,-1,8,9, 10,-1,-1,13,14,-1,-1,17,18,-1,20,21,-1,23, -1] # all