# parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024, False]],  
   [-1, 1, SPPF, [1024, 5]],  # 9

   [-4, 1, Conv, [64, 6, 2, 2]],  # 10-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 17-P5/32
   [-1, 3, C3, [1024, False]],  
   [-1, 1, SPPF, [1024, 5]],  # 19

   ############ illumination #############
   [-2, 1, IAN, [256]],  
   [[4,14,20], 1, Illumination_weight, [256]],    # 21 two stream fuse     ### layer20 is Illumination value
   [[6,16,20], 1, Illumination_weight, [512]],    # 22 two stream fuse
   [[9,19,20], 1, Illumination_weight, [1024]],    # 23 two stream fuse

   ######### Add Block #############
   [[4,21], 1, Add2, [256,0]],    # 24-P3/8 stream one x+trans[0]
   [[14,21], 1, Add2, [256,1]],    # 25-P3/8 stream two x+trans[1]

   [[6,22], 1, Add2, [512,0]],    # 26-P3/8 stream one x+trans[0]
   [[16,22], 1, Add2, [512,1]],    # 27-P3/8 stream two x+trans[1]

   [[9,23], 1, Add2, [1024,0]],    # 28-P5/32 stream one x+trans[0]
   [[19,23], 1, Add2, [1024,1]],    # 29-P5/32 stream two x+trans[1]

   [[24,25], 1, Add, [1]],   # 30-P3/8 fusion backbone P3
   [[26,27], 1, Add, [1]],   # 31-P4/16 fusion backbone P4
   [[28,29], 1, Add, [1]],   # 32-P5/32 fusion backbone P5
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,31], 1, Concat, [1]],           # 35 cat backbone P4
   [-1, 3, C3, [512, False]],           

   [-1, 1, Conv, [256, 1, 1]],          
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  
   [[-1,30], 1, Concat, [1]],           # 39 cat backbone P3
   [-1, 3, C3, [256, False]],           # 40 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          
   [[-1,37], 1, Concat, [1]],           # 42 cat head P4
   [-1, 3, C3, [512, False]],           # 43 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          
   [[-1,33], 1, Concat, [1]],           # 45 cat head P5
   [-1, 3, C3, [1024, False]],          # 46 (P5/32-large)

   [[40, 43, 46], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]

layer_list:
  [0,1,2,3,4,5,6,7,8,9, 0,1,2,3,4,5,6,7,8,9, -1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1, 10,-1,-1,13,14,-1,-1,17,18,-1,20,21,-1,23, -1] # all